In [1]:
import pandas as pd

In [2]:
data1={"name":["aa","bb","cc","dd","ee"],
      "city":["zanjan","tehran","rasht","shiraz","tabriz"],
      "score":[10,11,12,13,14]}

In [3]:
data1

{'name': ['aa', 'bb', 'cc', 'dd', 'ee'],
 'city': ['zanjan', 'tehran', 'rasht', 'shiraz', 'tabriz'],
 'score': [10, 11, 12, 13, 14]}

In [4]:
data_good=pd.DataFrame(data1)

In [5]:
data_good

  name    city  score
0   aa  zanjan     10
1   bb  tehran     11
2   cc   rasht     12
3   dd  shiraz     13
4   ee  tabriz     14

In [11]:
my_index=["red","yellow","green","blue","purple"]

In [12]:
data_good=pd.DataFrame(data1, index=my_index)

In [13]:
data_good

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11
green    cc   rasht     12
blue     dd  shiraz     13
purple   ee  tabriz     14

In [14]:
data_good.columns

Index(['name', 'city', 'score'], dtype='object')

In [15]:
data_good.index

Index(['red', 'yellow', 'green', 'blue', 'purple'], dtype='object')

In [16]:
type(data_good)

pandas.core.frame.DataFrame

In [18]:
data_good.iloc[0]

name         aa
city     zanjan
score        10
Name: red, dtype: object

In [19]:
data_good.iloc[[0,1]]

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11

In [20]:
data_good.iloc[[0,1],0]

red       aa
yellow    bb
Name: name, dtype: object

In [22]:
data_good.loc["red"]

name         aa
city     zanjan
score        10
Name: red, dtype: object

In [24]:
data_good.loc[["red","yellow"]]

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11

In [26]:
data_good.loc[["red","yellow"],"name"]

red       aa
yellow    bb
Name: name, dtype: object

In [27]:
data_good

       name    city  score
red      aa  zanjan     10
yellow   bb  tehran     11
green    cc   rasht     12
blue     dd  shiraz     13
purple   ee  tabriz     14

In [39]:
filter1=(data_good["name"]=="aa")  ### select rows with name "aa"

In [40]:
filter1

red        True
yellow    False
green     False
blue      False
purple    False
Name: name, dtype: bool

In [42]:
data_good.loc[filter1]

    name    city  score
red   aa  zanjan     10